tests/tsung/configurations/test_A.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/mnt/s/Projects/qesm/tsung/tsung-1.0.dtd">
<tsung loglevel="info" dumptraffic="protocol" version="1.0" backend="json">
  <information>
    <name> Test AND </name>
    <description> Test di due servizi concorrenti </description>
  </information>

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="$$USR$$" />
  </clients>

  <servers>
    <server host="localhost" port="8080" type="tcp" />
  </servers>

  <load duration="60" unit="second">
    <arrivalphase phase="1" duration="60" unit="second">
      <!-- N parameter -->
      <users arrivalrate="$$AR$$" unit="second" />
    </arrivalphase>
  </load>

  <sessions>
    <session name="first" type="ts_http" probability="100">
      <request>
        <http url="http://localhost:8080/service/sum?n=10000000" method="GET" version="1.1" />
      </request>
    </session>
  </sessions>
</tsung>