tests/tsung/configurations/test_B.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/mnt/s/Projects/qesm/tsung/tsung-1.0.dtd">
<tsung loglevel="info" dumptraffic="protocol" version="1.0" backend="json">
  <information>
    <name> Test AND </name>
    <description> Test di due servizi concorrenti </description>
  </information>

  <clients>
    <client host="localhost" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="localhost" port="8081" type="tcp" />
  </servers>

  <load duration="1" unit="minute">
    <arrivalphase phase="1" duration="60" unit="second">
      <!-- N parameter -->
      <users arrivalrate="$$AR$$" unit="second" />
    </arrivalphase>
  </load>

  <sessions>
    <session name="second" type="ts_http" probability="100">
      <for var="i" from="1" to="2" incr="0">
        <request>
          <http url="http://localhost:8081/service/sum?n=20000000" method="GET" version="1.1" />
        </request>
      </for>
    </session>
  </sessions>
</tsung>