tests/tsung/configurations/test_SEQ.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/mnt/s/Projects/qesm/tsung/tsung-1.0.dtd">
<!-- How many info do I want, what do  want and it's format -->
<tsung loglevel="info" dumptraffic="protocol" version="1.0" backend="json">
  <information>
    <name> Test AND </name>
    <description> Test di due servizi sequenziali </description>
  </information>

  <clients>
    <!-- N PARAMETER-->
    <client host="localhost" use_controller_vm="true" />
  </clients>

  <servers>
    <!-- Links to Containers -->
    <server host="localhost" port="8080" type="tcp" />
    <server host="localhost" port="8081" type="tcp" />
  </servers>

  <load duration="60" unit="second">
    <!-- How much time does the test last -->
    <arrivalphase duration="60" phase="1" unit="second">
      <users maxnumber="%%NUM_REQUESTS%%" arrivalrate="40" unit="second" />
    </arrivalphase>
  </load>

  <sessions>

    <!-- What does the test do -->
    <session name="first" type="ts_http" probability="100">
      <for var="i" from="1" to="2" incr="0">
        <transaction name="A">
          <request>
            <http url="http://localhost:8080/service/sum?n=10000000" method="GET" version="1.1" />
          </request>
        </transaction>
        <transaction name="B">
          <request>
            <http url="http://localhost:8081/service/sum?n=20000000" method="GET" version="1.1" />
          </request>
        </transaction>
      </for>
    </session>
  </sessions>
</tsung>